In [32]:
import pandas as pd
import numpy as np
from handle_categorical_features import *

In [33]:
import pandas as pd
import numpy as np
from handle_categorical_features import *
df = pd.read_csv('/home/iqube/Downloads/data.xls')

In [34]:
df = pd.read_csv('/home/iqube/Downloads/data.xls')

In [35]:
df.head(
        )

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
0,2014-05-02 00:00:00,313000.0,3.0,1.50,1340,7912,1.5,0,0,3,1340,0,1955,2005,18810 Densmore Ave N,Shoreline,WA 98133,USA
1,2014-05-02 00:00:00,2384000.0,5.0,2.50,3650,9050,2.0,0,4,5,3370,280,1921,0,709 W Blaine St,Seattle,WA 98119,USA
2,2014-05-02 00:00:00,342000.0,3.0,2.00,1930,11947,1.0,0,0,4,1930,0,1966,0,26206-26214 143rd Ave SE,Kent,WA 98042,USA
3,2014-05-02 00:00:00,420000.0,3.0,2.25,2000,8030,1.0,0,0,4,1000,1000,1963,0,857 170th Pl NE,Bellevue,WA 98008,USA
4,2014-05-02 00:00:00,550000.0,4.0,2.50,1940,10500,1.0,0,0,4,1140,800,1976,1992,9105 170th Ave NE,Redmond,WA 98052,USA

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4600 entries, 0 to 4599
Data columns (total 18 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           4600 non-null   object
 1   price          4600 non-null   float64
 2   bedrooms       4600 non-null   float64
 3   bathrooms      4600 non-null   float64
 4   sqft_living    4600 non-null   int64
 5   sqft_lot       4600 non-null   int64
 6   floors         4600 non-null   float64
 7   waterfront     4600 non-null   int64
 8   view           4600 non-null   int64
 9   condition      4600 non-null   int64
 10  sqft_above     4600 non-null   int64
 11  sqft_basement  4600 non-null   int64
 12  yr_built       4600 non-null   int64
 13  yr_renovated   4600 non-null   int64
 14  street         4600 non-null   object
 15  city           4600 non-null   object
 16  statezip       4600 non-null   object
 17  country        4600 non-null   object
dtypes: float64(4), int64(9), object(5)
memory usage: 647.0+ KB

In [37]:
import pandas as pd
import numpy as np
from handle_categorical_features import *
df = pd.read_csv('/home/iqube/Downloads/data.xls')
features = df.columns.to_list()

In [38]:
object_features = [ feature for feature in features if df[feature].dtype == 'O']

In [39]:
for i in object_features:

    print(f"Feature {i} has {len(df[i].unique())} unique values")
    print("\n")
    print("*"*100)

Feature date has 70 unique values


****************************************************************************************************
Feature street has 4525 unique values


****************************************************************************************************
Feature city has 44 unique values


****************************************************************************************************
Feature statezip has 77 unique values


****************************************************************************************************
Feature country has 1 unique values


****************************************************************************************************

In [40]:
df.drop(labels =['date','street','statezip','country'],axis = 1 , inplace = True)

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4600 entries, 0 to 4599
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   price          4600 non-null   float64
 1   bedrooms       4600 non-null   float64
 2   bathrooms      4600 non-null   float64
 3   sqft_living    4600 non-null   int64
 4   sqft_lot       4600 non-null   int64
 5   floors         4600 non-null   float64
 6   waterfront     4600 non-null   int64
 7   view           4600 non-null   int64
 8   condition      4600 non-null   int64
 9   sqft_above     4600 non-null   int64
 10  sqft_basement  4600 non-null   int64
 11  yr_built       4600 non-null   int64
 12  yr_renovated   4600 non-null   int64
 13  city           4600 non-null   object
dtypes: float64(4), int64(9), object(1)
memory usage: 503.3+ KB

In [42]:
features = df.columns

In [43]:
for i in features:
    print(i)

    print(f"Feature {i} has {len(df[i].unique())} unique values and of type {df[i].dtypes}")
    print("\n")
    print("*"*100)

price
Feature price has 1741 unique values and of type float64


****************************************************************************************************
bedrooms
Feature bedrooms has 10 unique values and of type float64


****************************************************************************************************
bathrooms
Feature bathrooms has 26 unique values and of type float64


****************************************************************************************************
sqft_living
Feature sqft_living has 566 unique values and of type int64


****************************************************************************************************
sqft_lot
Feature sqft_lot has 3113 unique values and of type int64


****************************************************************************************************
floors
Feature floors has 6 unique values and of type float64


****************************************************************************************************
waterfront
Feature waterfront has 2 unique values and of type int64


****************************************************************************************************
view
Feature view has 5 unique values and of type int64


****************************************************************************************************
condition
Feature condition has 5 unique values and of type int64


****************************************************************************************************
sqft_above
Feature sqft_above has 511 unique values and of type int64


****************************************************************************************************
sqft_basement
Feature sqft_basement has 207 unique values and of type int64


****************************************************************************************************
yr_built
Feature yr_built has 115 unique values and of type int64


****************************************************************************************************
yr_renovated
Feature yr_renovated has 60 unique values and of type int64


****************************************************************************************************
city
Feature city has 44 unique values and of type object


****************************************************************************************************

In [44]:
features

Index(['price', 'bedrooms', 'bathrooms', 'sqft_living', 'sqft_lot', 'floors',
       'waterfront', 'view', 'condition', 'sqft_above', 'sqft_basement',
       'yr_built', 'yr_renovated', 'city'],
      dtype='object')

In [45]:
df.drop(labels=['yr_renovated','yr_built'],axis=1,inplace=True)

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4600 entries, 0 to 4599
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   price          4600 non-null   float64
 1   bedrooms       4600 non-null   float64
 2   bathrooms      4600 non-null   float64
 3   sqft_living    4600 non-null   int64
 4   sqft_lot       4600 non-null   int64
 5   floors         4600 non-null   float64
 6   waterfront     4600 non-null   int64
 7   view           4600 non-null   int64
 8   condition      4600 non-null   int64
 9   sqft_above     4600 non-null   int64
 10  sqft_basement  4600 non-null   int64
 11  city           4600 non-null   object
dtypes: float64(4), int64(7), object(1)
memory usage: 431.4+ KB

In [47]:
features = df.columns

In [48]:
for i in features:
    print(i)

    print(f"Feature {i} has {len(df[i].unique())} unique values and of type {df[i].dtypes}")
    print("\n")
    print("*"*100)

price
Feature price has 1741 unique values and of type float64


****************************************************************************************************
bedrooms
Feature bedrooms has 10 unique values and of type float64


****************************************************************************************************
bathrooms
Feature bathrooms has 26 unique values and of type float64


****************************************************************************************************
sqft_living
Feature sqft_living has 566 unique values and of type int64


****************************************************************************************************
sqft_lot
Feature sqft_lot has 3113 unique values and of type int64


****************************************************************************************************
floors
Feature floors has 6 unique values and of type float64


****************************************************************************************************
waterfront
Feature waterfront has 2 unique values and of type int64


****************************************************************************************************
view
Feature view has 5 unique values and of type int64


****************************************************************************************************
condition
Feature condition has 5 unique values and of type int64


****************************************************************************************************
sqft_above
Feature sqft_above has 511 unique values and of type int64


****************************************************************************************************
sqft_basement
Feature sqft_basement has 207 unique values and of type int64


****************************************************************************************************
city
Feature city has 44 unique values and of type object


****************************************************************************************************

In [49]:
df.drop_duplicates(inplace=True)

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4600 entries, 0 to 4599
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   price          4600 non-null   float64
 1   bedrooms       4600 non-null   float64
 2   bathrooms      4600 non-null   float64
 3   sqft_living    4600 non-null   int64
 4   sqft_lot       4600 non-null   int64
 5   floors         4600 non-null   float64
 6   waterfront     4600 non-null   int64
 7   view           4600 non-null   int64
 8   condition      4600 non-null   int64
 9   sqft_above     4600 non-null   int64
 10  sqft_basement  4600 non-null   int64
 11  city           4600 non-null   object
dtypes: float64(4), int64(7), object(1)
memory usage: 431.4+ KB

In [51]:
import pandas as pd
import numpy as np
from handle_categorical_features import *
df = pd.read_csv('/home/iqube/Downloads/data.xls')
features = df.columns.to_list()
categorical_features = [feature for feature in features if len(df[feature].unique()) <= 50]

In [52]:
for i in categorical_features:


    print("_"* 100)
    print("\n")
    print(f"Feature { i }:")
    for j in df[i].unique():
        print(j,end='\n')

____________________________________________________________________________________________________


Feature bedrooms:
3.0
5.0
4.0
2.0
6.0
7.0
9.0
1.0
8.0
0.0
____________________________________________________________________________________________________


Feature bathrooms:
1.5
2.5
2.0
2.25
1.0
1.75
2.75
3.0
3.25
3.5
8.0
4.25
4.0
3.75
5.0
4.5
5.75
1.25
6.5
4.75
0.75
5.25
5.5
6.25
0.0
6.75
____________________________________________________________________________________________________


Feature floors:
1.5
2.0
1.0
2.5
3.0
3.5
____________________________________________________________________________________________________


Feature waterfront:
0
1
____________________________________________________________________________________________________


Feature view:
0
4
1
2
3
____________________________________________________________________________________________________


Feature condition:
3
5
4
2
1
____________________________________________________________________________________________________


Feature city:
Shoreline
Seattle
Kent
Bellevue
Redmond
Maple Valley
North Bend
Lake Forest Park
Sammamish
Auburn
Des Moines
Bothell
Federal Way
Kirkland
Issaquah
Woodinville
Normandy Park
Fall City
Renton
Carnation
Snoqualmie
Duvall
Burien
Covington
Inglewood-Finn Hill
Kenmore
Newcastle
Mercer Island
Black Diamond
Ravensdale
Clyde Hill
Algona
Skykomish
Tukwila
Vashon
Yarrow Point
SeaTac
Medina
Enumclaw
Snoqualmie Pass
Pacific
Beaux Arts Village
Preston
Milton
____________________________________________________________________________________________________


Feature country:
USA

In [53]:
for i in categorical_features:


    print("_"* 100)
    print("\n")
    print(f"Feature { i }:")
    print(df[i].value_counts())

____________________________________________________________________________________________________


Feature bedrooms:
bedrooms
3.0    2032
4.0    1531
2.0     566
5.0     353
6.0      61
1.0      38
7.0      14
8.0       2
0.0       2
9.0       1
Name: count, dtype: int64
____________________________________________________________________________________________________


Feature bathrooms:
bathrooms
2.50    1189
1.00     743
1.75     629
2.00     427
2.25     419
1.50     291
2.75     276
3.00     167
3.50     162
3.25     136
3.75      37
4.50      29
4.25      23
4.00      23
0.75      17
4.75       7
5.00       6
5.25       4
5.50       4
1.25       3
6.25       2
0.00       2
8.00       1
5.75       1
6.50       1
6.75       1
Name: count, dtype: int64
____________________________________________________________________________________________________


Feature floors:
floors
1.0    2174
2.0    1811
1.5     444
3.0     128
2.5      41
3.5       2
Name: count, dtype: int64
____________________________________________________________________________________________________


Feature waterfront:
waterfront
0    4567
1      33
Name: count, dtype: int64
____________________________________________________________________________________________________


Feature view:
view
0    4140
2     205
3     116
4      70
1      69
Name: count, dtype: int64
____________________________________________________________________________________________________


Feature condition:
condition
3    2875
4    1252
5     435
2      32
1       6
Name: count, dtype: int64
____________________________________________________________________________________________________


Feature city:
city
Seattle                1573
Renton                  293
Bellevue                286
Redmond                 235
Issaquah                187
Kirkland                187
Kent                    185
Auburn                  176
Sammamish               175
Federal Way             148
Shoreline               123
Woodinville             115
Maple Valley             96
Mercer Island            86
Burien                   74
Snoqualmie               71
Kenmore                  66
Des Moines               58
North Bend               50
Covington                43
Duvall                   42
Lake Forest Park         36
Bothell                  33
Newcastle                33
SeaTac                   29
Tukwila                  29
Vashon                   29
Enumclaw                 28
Carnation                22
Normandy Park            18
Clyde Hill               11
Medina                   11
Fall City                11
Black Diamond             9
Ravensdale                7
Pacific                   6
Algona                    5
Yarrow Point              4
Skykomish                 3
Preston                   2
Milton                    2
Inglewood-Finn Hill       1
Snoqualmie Pass           1
Beaux Arts Village        1
Name: count, dtype: int64
____________________________________________________________________________________________________


Feature country:
country
USA    4600
Name: count, dtype: int64

In [54]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()

In [55]:
feature = 'bedrooms'
class_to_count = 3

# Count occurrences of each class
class_counts = df[feature].value_counts()

# Get frequency of the specific class
class_frequency = class_counts.get(class_to_count, 0)

print(f"The frequency of class '{class_to_count}' in feature '{feature}' is: {class_frequency}")

The frequency of class '3' in feature 'bedrooms' is: 2032

In [56]:
vc = df['bedrooms'].value_counts()

In [57]:
vc

bedrooms
3.0    2032
4.0    1531
2.0     566
5.0     353
6.0      61
1.0      38
7.0      14
8.0       2
0.0       2
9.0       1
Name: count, dtype: int64

In [58]:
(vc)

bedrooms
3.0    2032
4.0    1531
2.0     566
5.0     353
6.0      61
1.0      38
7.0      14
8.0       2
0.0       2
9.0       1
Name: count, dtype: int64

In [59]:
def check_class_frequency(dataframe,feature):

    class_counts = dataframe[feature].value_counts()
    class_to_count = dataframe[feature].unique()
    class_with_low_frequency = []



    for i in class_to_count:
        
        class_frequency = class_counts.get(i, 0)
        l = len(dataframe)
        
        if class_frequency > (0.005 * l):
            
            class_with_low_frequency.append(i)
            
    return class_with_low_frequency

In [60]:
for i in categorical_features:

    l = check_class_frequency(df,i)
    print(l)

[3.0, 5.0, 4.0, 2.0, 6.0, 1.0]
[1.5, 2.5, 2.0, 2.25, 1.0, 1.75, 2.75, 3.0, 3.25, 3.5, 3.75, 4.5]
[1.5, 2.0, 1.0, 2.5, 3.0]
[0, 1]
[0, 4, 1, 2, 3]
[3, 5, 4, 2]
['Shoreline', 'Seattle', 'Kent', 'Bellevue', 'Redmond', 'Maple Valley', 'North Bend', 'Lake Forest Park', 'Sammamish', 'Auburn', 'Des Moines', 'Bothell', 'Federal Way', 'Kirkland', 'Issaquah', 'Woodinville', 'Renton', 'Snoqualmie', 'Duvall', 'Burien', 'Covington', 'Kenmore', 'Newcastle', 'Mercer Island', 'Tukwila', 'Vashon', 'SeaTac', 'Enumclaw']
['USA']

In [61]:
l

['USA']

In [62]:
def check_class_frequency(dataframe,feature):

    class_counts = dataframe[feature].value_counts()
    class_to_count = dataframe[feature].unique()
    class_with_high_frequency = []



    for i in class_to_count:
        
        class_frequency = class_counts.get(i, 0)
        l = len(dataframe)
        
        if class_frequency > (0.005 * l):
            
            class_with_high_frequency.append(i)
    return class_with_high_frequency

In [63]:
def create_rare_class(dataframe , feature, classes_with_high_frequency):

    c = tuple(zip(classes_with_high_frequency,classes_with_high_frequency))
    d = dict(c)
    print(d)
    dataframe[feature] = dataframe[feature].map(d)
    dataframe[feature].fillna(value = 'Rare', inplace = True)
    return dataframe[feature]

In [64]:
l = check_class_frequency(df,'bedrooms')

In [65]:
l

[3.0, 5.0, 4.0, 2.0, 6.0, 1.0]

In [66]:
df['bedrooms'] = create_rare_class(df,'bedrooms',l)

{3.0: 3.0, 5.0: 5.0, 4.0: 4.0, 2.0: 2.0, 6.0: 6.0, 1.0: 1.0}

/tmp/ipykernel_5466/242768182.py:7: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'Rare' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  dataframe[feature].fillna(value = 'Rare', inplace = True)

In [67]:
df['bedrooms'].value_counts()

bedrooms
3.0     2032
4.0     1531
2.0      566
5.0      353
6.0       61
1.0       38
Rare      19
Name: count, dtype: int64

In [68]:
df['bedrooms'].unique()

array([3.0, 5.0, 4.0, 2.0, 6.0, 'Rare', 1.0], dtype=object)

In [69]:
df['bedrooms'].isnull().sum()

0

In [70]:
categorical_features

['bedrooms',
 'bathrooms',
 'floors',
 'waterfront',
 'view',
 'condition',
 'city',
 'country']

In [71]:
df2 = df[categorical_features]
df2.isnull().sum()

bedrooms      0
bathrooms     0
floors        0
waterfront    0
view          0
condition     0
city          0
country       0
dtype: int64

In [97]:
import pandas as pd
import numpy as np
from handle_categorical_features import *
# Create a sample DataFrame
data = {
    'Category': ['A', 'B', 'C', 'A', 'B', 'C', 'A', 'B', 'C', np.nan],
    'Value': [10, 20, np.nan, 30, 40, 50, np.nan, 60, 70, 80],
    'Other': ['X', 'Y', 'Z', 'X', 'Y', 'Z', 'X', 'Y', 'Z', 'X']
}

df = pd.DataFrame(data)

# Print the DataFrame
print("Original DataFrame:")

features = df.columns.to_list()
categorical_features = [feature for feature in features if len(df[feature].unique()) <= 50]
df

Original DataFrame:

  Category  Value Other
0        A   10.0     X
1        B   20.0     Y
2        C    NaN     Z
3        A   30.0     X
4        B   40.0     Y
5        C   50.0     Z
6        A    NaN     X
7        B   60.0     Y
8        C   70.0     Z
9      NaN   80.0     X

In [73]:
start_categorical_feature_preprocessing(df,categorical_features)

Before
0      A
1      B
2      C
3      A
4      B
5      C
6      A
7      B
8      C
9    NaN
Name: Category, dtype: object
Filled null values of feature Category with class 'A'
After
0    A
1    B
2    C
3    A
4    B
5    C
6    A
7    B
8    C
9    A
Name: Category, dtype: object
{'A': 'A', 'B': 'B', 'C': 'C'}
Before
0    10.0
1    20.0
2     NaN
3    30.0
4    40.0
5    50.0
6     NaN
7    60.0
8    70.0
9    80.0
Name: Value, dtype: float64
Filled null values of feature Value with class '10.0'
After
0    10.0
1    20.0
2    10.0
3    30.0
4    40.0
5    50.0
6    10.0
7    60.0
8    70.0
9    80.0
Name: Value, dtype: float64
{10.0: 10.0, 20.0: 20.0, 30.0: 30.0, 40.0: 40.0, 50.0: 50.0, 60.0: 60.0, 70.0: 70.0, 80.0: 80.0}
Before
0    X
1    Y
2    Z
3    X
4    Y
5    Z
6    X
7    Y
8    Z
9    X
Name: Other, dtype: object
Filled null values of feature Other with class 'X'
After
0    X
1    Y
2    Z
3    X
4    Y
5    Z
6    X
7    Y
8    Z
9    X
Name: Other, dtype: object
{'X': 'X', 'Y': 'Y', 'Z': 'Z'}

In [74]:
get_global_dataframe()

   Category  Value  Other
0         0      0      0
1         1      1      1
2         2      0      2
3         0      2      0
4         1      3      1
5         2      4      2
6         0      0      0
7         1      5      1
8         2      6      2
9         0      7      0

In [75]:
df['Value']

0    0
1    1
2    0
3    2
4    3
5    4
6    0
7    5
8    6
9    7
Name: Value, dtype: int64

In [76]:
df

   Category  Value  Other
0         0      0      0
1         1      1      1
2         2      0      2
3         0      2      0
4         1      3      1
5         2      4      2
6         0      0      0
7         1      5      1
8         2      6      2
9         0      7      0

In [77]:
df

   Category  Value  Other
0         0      0      0
1         1      1      1
2         2      0      2
3         0      2      0
4         1      3      1
5         2      4      2
6         0      0      0
7         1      5      1
8         2      6      2
9         0      7      0

In [98]:
# Create a sample DataFrame
data = {
    'Category': ['A', 'B', 'C', 'A', 'B', 'C', 'A', 'B', 'C', np.nan],
    'Value': [10, 20, np.nan, 30, 40, 50, np.nan, 60, 70, 80],
    'Other': ['X', 'Y', 'Z', 'X', 'Y', 'Z', 'X', 'Y', 'Z', 'X']
}

df = pd.DataFrame(data)

# Print the DataFrame
print("Original DataFrame:")
df

Original DataFrame:

  Category  Value Other
0        A   10.0     X
1        B   20.0     Y
2        C    NaN     Z
3        A   30.0     X
4        B   40.0     Y
5        C   50.0     Z
6        A    NaN     X
7        B   60.0     Y
8        C   70.0     Z
9      NaN   80.0     X

In [79]:
df['Category'].fillna(value = df['Category'].mode())

0      A
1      B
2      C
3      A
4      B
5      C
6      A
7      B
8      C
9    NaN
Name: Category, dtype: object

In [80]:
encode_features(df,'Other')

In [81]:

def encode_features(dataframe,feature):
   
    a = dataframe[feature].unique()
    print(a)
    b = range(len(a))
    print(b)
    c = zip(a,b)
    d = dict(tuple(c))
    print(d)
    data[feature]=dataframe[feature].map(d)
    print(dataframe[feature])

In [82]:
def fill_categorical_null(dataframe,feature):


    if dataframe[feature].isnull().sum() < (0.35 * len(dataframe)):
        
        
        print("Before")
        print(dataframe[feature])
        dataframe[feature].fillna(value = dataframe[feature].mode()[0],inplace = True)
        handle_categorical_features.update_dataframe(dataframe)    
        print(f"Filled null values of feature {feature} with class '{dataframe[feature].mode()[0]}'")
        print('After')
        print(dataframe[feature])

In [83]:

encode_features(df,'Category')

['A' 'B' 'C' nan]
range(0, 4)
{'A': 0, 'B': 1, 'C': 2, nan: 3}
0      A
1      B
2      C
3      A
4      B
5      C
6      A
7      B
8      C
9    NaN
Name: Category, dtype: object

In [84]:
data

{'Category': 0    0
 1    1
 2    2
 3    0
 4    1
 5    2
 6    0
 7    1
 8    2
 9    3
 Name: Category, dtype: int64,
 'Value': [10, 20, nan, 30, 40, 50, nan, 60, 70, 80],
 'Other': ['X', 'Y', 'Z', 'X', 'Y', 'Z', 'X', 'Y', 'Z', 'X']}

In [85]:
a = df['Category'].unique()
print(a)
b = range(len(a))
print(b)
c = zip(a,b)
d = dict(tuple(c))

['A' 'B' 'C' nan]
range(0, 4)

In [86]:
df['Category']=df['Category'].map(d)
print(df['Category'])

0    0
1    1
2    2
3    0
4    1
5    2
6    0
7    1
8    2
9    3
Name: Category, dtype: int64

In [87]:
sorted_dict_by_values = dict(sorted(null_amount.items(), key=lambda item: item[1]))

In [88]:
null_amount = {'a':7,'b':5,'c':6,'d' : 4}

In [89]:
sorted_dict_by_values

{'d': 4, 'b': 5, 'c': 6, 'a': 7}

In [104]:
def remove_features_with_priority(global_dataframe , global_features , number):

    null_amount = dict()

    for feature in global_features:

        null_amount[feature] = global_dataframe[feature].isnull().sum()
    
    sorted_dict_by_values = dict(sorted(null_amount.items(), key=lambda item: item[1]))
    global_dataframe = global_dataframe[list(sorted_dict_by_values.keys())[:number]]

In [105]:
remove_features_with_priority(df,features,2)

  Other Category
0     X        A
1     Y        B
2     Z        C
3     X        A
4     Y        B
5     Z        C
6     X        A
7     Y        B
8     Z        C
9     X      NaN

In [2]:
import pandas as pd
import numpy as np

# Number of records
total_records = 1500
num_classes = 15  # Number of classes for each categorical feature

# Creating a DataFrame with 2 categorical features, 2 numerical features, and a target feature
data = {
    'categorical_feature_1': np.random.choice([f'category_{i}' for i in range(num_classes)], total_records),
    'categorical_feature_2': np.random.choice([f'object_category_{i}' for i in range(num_classes)], total_records),
    'numerical_feature_1': np.random.randn(total_records),
    'numerical_feature_2': np.random.randn(total_records),
    'target': np.random.choice([0, 1], total_records)  # Target feature with values 0 and 1
}

# Introducing NaN values in the first categorical feature
nan_indices = np.random.choice(total_records, size=int(total_records * 0.6), replace=False)
data['categorical_feature_1'][nan_indices] = np.nan

# Creating a DataFrame
df = pd.DataFrame(data)

# Convert 'categorical_feature_2' to dtype 'object'
df['categorical_feature_2'] = df['categorical_feature_2'].astype('object')

# Display the DataFrame
print(df)

     categorical_feature_1 categorical_feature_2  numerical_feature_1  \
0                      nan     object_category_1            -1.088663
1               category_7     object_category_6             0.284185
2                      nan     object_category_9            -0.403853
3              category_12     object_category_4             0.061933
4                      nan    object_category_14             0.818559
...                    ...                   ...                  ...
1495                   nan    object_category_14            -0.250861
1496                   nan     object_category_7             0.079220
1497            category_2     object_category_0             0.279983
1498            category_8    object_category_13            -0.588549
1499                   nan    object_category_13             0.800995

      numerical_feature_2  target
0               -0.259949       0
1                2.789960       0
2               -0.309437       1
3                0.174542       1
4                1.429940       0
...                   ...     ...
1495             0.610347       1
1496             0.696177       0
1497             1.296516       0
1498             0.137904       0
1499             0.579455       0

[1500 rows x 5 columns]

In [3]:
df

,categorical_feature_1,categorical_feature_2,numerical_feature_1,numerical_feature_2,target
0,nan,object_category_1,-1.088663,-0.259949,0
1,category_7,object_category_6,0.284185,2.789960,0
2,nan,object_category_9,-0.403853,-0.309437,1
3,category_12,object_category_4,0.061933,0.174542,1
4,nan,object_category_14,0.818559,1.429940,0
...,...,...,...,...,...
1495,nan,object_category_14,-0.250861,0.610347,1
1496,nan,object_category_7,0.079220,0.696177,0
1497,category_2,object_category_0,0.279983,1.296516,0
1498,category_8,object_category_13,-0.588549,0.137904,0
1499,nan,object_category_13,0.800995,0.579455,0

In [132]:
len(df['categorical_feature_1'].unique())

16

In [133]:
# Save DataFrame to CSV file
df.to_csv('dataset.csv', index=False)

In [129]:
len(df['categorical_feature_1'].unique())

16

In [134]:
df

,categorical_feature_1,categorical_feature_2,numerical_feature_1,numerical_feature_2,target
0,nan,object_category_8,-1.967162,0.636070,0
1,nan,object_category_0,1.045327,-0.088962,0
2,category_6,object_category_7,1.487367,-2.529500,1
3,nan,object_category_10,0.650361,0.328308,0
4,nan,object_category_1,0.037850,-2.785883,0
...,...,...,...,...,...
1495,category_4,object_category_8,-0.587053,-1.677514,1
1496,category_10,object_category_10,0.169709,1.230243,0
1497,nan,object_category_8,-2.333901,0.442753,0
1498,nan,object_category_6,0.340650,-0.041460,1
1499,category_6,object_category_6,-0.672816,0.510664,1

In [138]:

df.drop(['target'], axis = 1)

,categorical_feature_1,categorical_feature_2,numerical_feature_1,numerical_feature_2,target
0,nan,object_category_8,-1.967162,0.636070,0
1,nan,object_category_0,1.045327,-0.088962,0
2,category_6,object_category_7,1.487367,-2.529500,1
3,nan,object_category_10,0.650361,0.328308,0
4,nan,object_category_1,0.037850,-2.785883,0

In [4]:
import pandas as pd

# Assuming your dataset is stored in a dictionary
data = {
    'column1': 1,
    'column2': 'a',    
    'column3': True
}

# Create a DataFrame from the dictionary
df = pd.DataFrame(data , index = range(len(data)))

# Print the DataFrame
print(df)

   column1 column2  column3
0        1       a     True
1        1       a     True
2        1       a     True

In [4]:
from sklearn.model_selection import train_test_split
x = df.drop(columns = ['target'])
y =  df['target']
# Split the resampled data into training and testing sets
X_train, X_test, y_train, y_test = train_test_split(x,y, test_size=0.2, random_state=42)

# Now you can use X_train and y_train for training your model
# And X_test and y_test for evaluating its performance

In [5]:
U , C = np.unique(y , return_counts=True)

In [6]:
U

array([0, 1])

In [7]:
C

array([744, 756])

In [8]:
import tensorflow as tf
from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Dense

# Define the model architecture
model = Sequential([
    Dense(64, activation='relu', input_shape=(X_train.shape[1],)),  # Input layer with 64 neurons and ReLU activation function
    Dense(32, activation='relu'),  # Hidden layer with 32 neurons and ReLU activation function
    Dense(1, activation='sigmoid')  # Output layer with 1 neuron and sigmoid activation function for binary classification
])

# Compile the model
model.compile(optimizer='adam', loss='binary_crossentropy', metrics=['accuracy'])

# Print the model summary
model.summary()

ModuleNotFoundError: No module named 'tensorflow'